taboadaa/ShuQi/nRF/Packages/.cache/TexasInstruments.MSP432P4xx_DFP.3.0.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>TexasInstruments</vendor>
  <name>MSP432P4xx_DFP</name>
  <description>Device Family Pack for Texas Instruments SimpleLink(TM) MSP432 Series</description>
  <url>http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/msp432cmsis/latest/exports</url>
  <supportContact>http://e2e.ti.com/support/microcontrollers/msp430/</supportContact>
  <license>license.txt</license>

  <releases>
    <release version="3.1.0" date="2017-04-28">
  New device support:
  - Added support for MSP432P4111
  MSP432 Header and Support Files Changes:
  - Fixed project creation bugs in IAR EWARM and Atollic TrueSTUDIO
  - Minor enhancements to pdsc file
    </release>
    <release version="3.0.0" date="2017-02-22">
  This pack adds support for IAR EWARM and Atollic TrueSTUDIO.
  
  MSP432 Header and Support Files Changes:
  - Adding linker and startup files for Atollic
  - Adding flash loaders for IAR
  - Minor fixes to pdsc file
  - Fixing copyright in startup file for KEIL
    </release>
    <release version="2.2.1" date="2016-08-25">
  MSP432 Header and Support Files Changes:
  - Minor fixes to pdsc file
  - Adding board images linkes to pdsc
    </release>
    <release version="2.2.0" date="2016-06-02">
  New device support:
  - Added support for MSP432P401M
    </release>
  <release version="2.1.1">
  New device support:
  - Enabled support of RevB material with revision id 0x4100
    </release>
    <release version="2.1.0">
  New device support:
  - Flash loader supports upcoming RevC silicon material of MSP432P401R

  MSP432 Header and Support Files Changes:
  - Included definition for MSP432 mailbox structure into device header file
    </release>
    <release version="2.0.0">
  This device family pack replaces TexasInstruments.MSP432

  New device support:
  - MSP432P401R RevC
  - MSP432P401R ES/ES2 revisions are no longer supported

  Bug fixes in KEIL Flash Loader:
  - Support restore of clock settings after flash programming

  MSP432 Header and Support Files Changes:
  - Adapted device specific header file coding style to CMSIS
    = Replaced repeated structs with generic structs
    = Removed bit fields and Hungarian notation from CMSIS structs
    = Removed HWREG #defines
    = Added explicit IP prefix to all bit definitions
    = Moved MSP430 style registers to msp432p401r_classic.h
    = Added doxygen style comments
  - Bugfix: Added HAS_PORT definitions to device header file
  - Bugfix: Corrected wrong MPU_RASR bit fields in device header file
  - Added CMSIS compliant system_msp432p401r.c source
  - Renamed msp432_startup.s to startup_msp432p401r_uvision.s
    </release>
  </releases>

  <requirements>   
    <packages>     
      <package vendor="ARM" name="CMSIS" version="4.5.0"/>   
    </packages> 
  </requirements>
  
  <!-- devices section (mandatory for Device Family Packs) -->
  <devices>
    <family Dfamily="MSP432P4xx Series" Dvendor="Texas Instruments:16">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <debugconfig default="swd" clock="10000000" swj="1"/>
      <book name="http://infocenter.arm.com/help/topic/com.arm.doc.dui0553a/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <book name="http://www.ti.com/lit/pdf/slau356" title="MSP432P4xx Family Technical Reference Manual"/>
      <book name="http://www.ti.com/lit/pdf/slau590" title="ARM&#174; Keil&#174; MDK 5 IDE for SimpleLink&#8482; MSP432&#8482; User's Guide"/>
      <description>
The SimpleLink(TM) MSP432P4xx microcontrollers (MCUs) are optimized wireless host MCUs with an integrated 14-bit analog-to-digital converter (ADC) capable of up to 16 ENOB delivering ultra-low-power performance including 80 &#181;A/MHz in active power and 660 nA in standby power with FPU and DSP extensions. 
As an optimized wireless host MCU, the MSP432P4xx allows developers to add high-precision analog and memory extension to applications based on SimpleLink wireless connectivity solutions. 
More information on MSP432 MCUs at http://www.ti.com/msp432.
      </description>
       
      <!-- features common for the whole family -->
      <feature type="ADC" n="24" m="14"/>
      <feature type="VCC" n="1.62" m="3.7"/>
      <feature type="AnalogOther" n="2" name="Analog Comparator"/>
      <feature type="Crypto" n="128.256" name="HW accelerated AES Encryption Engine"/>
      <feature type="TempSens" n="1"/>
      <feature type="Timer" n="4" m="16" name="Up to 4 timers/PWM/CCP"/>
      <feature type="Timer" n="2" m="32" name="GP Timers"/>
      <feature type="ComOther" n="4" name="UART or SPI"/>
      <feature type="ComOther" n="4" name="I2C or SPI"/>

      <!-- debug sequences -->  
      <sequences>
      <!-- Unlock a device which has been secured -->
        <sequence name="DebugDeviceUnlock">
          <block>
            __var securityIsEnabled = 0;
            __var unlockDevice = 0;
            DAP_Delay(100000);
            Write32(0xE0044000, 0x0000695A);
            securityIsEnabled = Read32(0xE0044020);
          </block>
          <control if="securityIsEnabled &amp; 0x38">
            <block>
              unlockDevice = Query(1, "Device is locked. Erase all memory and unlock device?", 1);
            </block>
            <control if="unlockDevice">
              <block>
                // Write reboot sequence to SYSCTL registers
                Write32(0xE0044000, 0x0000695A);
                Write32(0xE0044004, 0x00000001);
                Write32(0xE0044008, 0x00000000);
                Write32(0xE0044010, 0x00006902);
                Sequence("DebugDeviceUnlock");
              </block>
            </control>
          </control>
        </sequence>
        <!-- <control if="!(securityIsEnabled &amp; 0x38)"> -->
        <sequence name="DebugCodeMemRemap">
          <block>
            __var deviceId = 0;
            __var hwRevision = 0;
            __var isMSP432P401M = 0;
            __var isMSP432P401R = 0;
            __var isMSP432P4111 = 0;
            __var isMSP432P4xx_FLCTL = 0;
            __var isMSP432P4xx_FLCTL_A = 0;
            __var isMSP432P4xx_FLCTL_PreProduction = 0;
            __var isMSP432P4xx_FLCTL_Production = 0;
            __var qResult = 0;
            deviceId =   Read32(0x0020100C);
            hwRevision = Read32(0x00201010);
            isMSP432P401M = 
                  (deviceId == 0x0000A001) ||
                  (deviceId == 0x0000A003) ||
                  (deviceId == 0x0000A005);
            isMSP432P401R = 
                  (deviceId == 0x0000A000) ||
                  (deviceId == 0x0000A002) ||
                  (deviceId == 0x0000A004);
            isMSP432P4111 =
                  (deviceId == 0x0000A010) ||
                  (deviceId == 0x0000A020);
            isMSP432P4xx_FLCTL = isMSP432P401M || isMSP432P401R;
            isMSP432P4xx_FLCTL_A = isMSP432P4111;
            isMSP432P4xx_FLCTL_PreProduction = isMSP432P4xx_FLCTL &amp;&amp;
                  (
                    (hwRevision == 0x00000042) || 
                    (hwRevision == 0x00004100)
                  );
            isMSP432P4xx_FLCTL_Production= isMSP432P4xx_FLCTL&amp;&amp;
                  (
                    (hwRevision &gt;= 0x00000043) &amp;&amp;
                    (hwRevision &lt;= 0x00000049)
                  );
          </block>

          <!-- Check if the device is old material -->
          <control if="isMSP432P4xx_FLCTL_PreProduction" >
            <block>
            <!-- don't issue a warning here
              qResult = Query(0, "Your current XMS432P401R device is pre-production silicon. Although this material will still be supported in the foreseeable future, you are recommended to replace it with production silicon to gain access to new silicon features outlined on www.ti.com/lit/pdf/slaa700.\nOption 1: Order MSP432P401x production material at www.ti.com/product/MSP432P401R.\nOption 2: Continue using XMS432P401R pre-production silicon. Make sure to use the supported versions of IDEs and software, details available at www.ti.com/XMS432Support.", 0);
            -->
            </block>
          </control>
          <control if="!isMSP432P4xx_FLCTL_PreProduction &amp;&amp; !isMSP432P4xx_FLCTL_Production &amp;&amp; !isMSP432P4xx_FLCTL_A">
            <block>
              Query(0, "Your XMS432P401R material is no longer supported. We recommend you moving to production-quality MSP432P401R/M silicon by ordering samples at www.ti.com/product/MSP432P401R.", 0);
            </block>
          </control>
      </sequence>
                    
